{
  "name": "trebekbot",
  "description": "A Jeopardy! bot for Slack.",
  "keywords": [
    "slack",
    "bot",
    "jeopardy"
  ],
  "repository": "https://github.com/gesteves/trebekbot",
  "addons": [
    "rediscloud",
    "papertrail"
  ],
  "success_url": "https://github.com/gesteves/trebekbot#usage",
  "env": {
    "OUTGOING_WEBHOOK_TOKEN": {
      "description": "The token of the Slack outgoing webhook you'll use for this. Set it up at https://slack.com/services/new/outgoing-webhook. You'll have to point it to this app's URL once it's deployed.",
      "required": true
    },
    "API_TOKEN": {
      "description": "The Slack API key. Get it at https://api.slack.com/web",
      "required": true
    },
    "BOT_USERNAME": {
      "description": "The trigger word you set for the outgoing webhook.",
      "required": true,
      "value": "trebekbot"
    },
    "SIMILARITY_THRESHOLD": {
      "description": "From 0 to 1, how similar user answers need to be to the actual answer to be accepted. 1 means exact match; lower values give users some margin for error (e.g typos) but could cause false positives.",
      "required": true,
      "value": "0.5"
    },
    "SECONDS_TO_ANSWER": {
      "description": "Time, in seconds, users have to answer each round.",
      "required": true,
      "value": "30"
    },
    "CHANNEL_BLACKLIST": {
      "description": "Comma-separated list of channel names in which this bot is not allowed to respond",
      "required": false,
      "value": "general"
    },
    "QUESTION_SUBSTRING_BLACKLIST": {
      "description": "Comma-separated list of strings which indicate a question containing any of these should be ignored.",
      "required": false,
      "value": [
        "seen here",
        "[audio clue]",
        "[state outline]",
        "[flag]"
      ]
  },
  "ENABLE_FINAL_JEOPARDY": {
      "description": "Boolean to determine whether or not Final Jeopardy! functionality should auto-start when the categories have been exhausted.",
      "required": true,
      "value": "true"
  },
  "ENABLE_RANDOM_QUESTIONS": {
      "description": "Boolean to determine whether or not 'trebekbot jeopardy me' should retrieve random questions.",
      "required": true,
      "value": "true"
  },
  "DEFAULT_CATEGORY_COUNT": {
    "description": "Number of categories that a single round should consist of.",
    "required": true,
    "value": "5"
  },
  "SCORE_MALUS_UPDATE_RESPONSE": {
    "description": "Responses Trebekbot will give when adding a malus to your score.",
    "required": true,
    "value": [
      "Your score is now",
      "That brings you down to",
      "How much does that leave you with now?  Oh yes,",
      "How much did you wager?  Ouch.  Well at least you have"
    ]
  },
  "SCORE_BONUS_UPDATE_RESPONSE": {
    "description": "Responses Trebekbot will give when adding a bonus to your score.",
    "required": true,
    "value": [
      "Your score is now",
      "That brings you up to"
    ]
  },
  "WRONG_ANSWER_RESPONSE": {
    "description": "Responses trebekbot will give when you answer incorrectly.",
    "required": true,
    "value": [
      "You're fast on the button, but your brain's not catching up!",
      "Nope.  It will be goodbye for you today.",
      "One of the main differences between regular shows and kids week is emotion.  As talented as you are, you havn't had very much experience with not winning.",
      "Ah, if only you had been able to accumulate more money.",
      "You were having difficulties with that signaling device.  I saw.  You won't be around for Final Jeopardy!",
      "It's a shame you weren't faster on the signaling button in earlier rounds.",
      "It's been happening a lot lately.  Two of the players get off to a good start, and you start off badly.",
      "Sorry, Nope.  That's wrong.",
      "You made a common error there.",
      "Let me see if I can make you feel better. It's incorrect.",
      "You've been up and down.  Mostly down.",
      "Maybe the categories didn't agree with you last round.  Perhaps you will like them better in this round.",
      "You'll will try to get yourself out of the whole...when we come back. ",
      "That is incorrect.  And I think you suspected that was wrong.",
      "Ooh, drawing a blank.  That'll cost you.",
      "What we've discovered here on Jeopardy! about you: You don't know recent American history.  And by recent history I mean the past 50 years.",
      "Yeah.  Incorrect.  You should have stuck with your original thought.",
      "You know what they have to do in this Double Jeopardy! round.  First you have to get yourself out of the hole.",
      "We have to penalize you and once again you are in a negative situation.",
      "The way you said that is exactly the way a contestant on Wheel of Fortune would say it.",
      "You have serious education problems.",
      "Your mom cries when you succeed.  How is she dealing with a failure?",
      "Nope.  Not good enough.  Not gonna help you.",
      "Sorry, that ain't gonna do it.",
      "You weren't able to come up with a correct response.",
      "Two words of advice: get serious.",
      "I feared some of you might put that down.  That is incorrect.",
      "You've been burying a very deep hole.  Let's see if you can change that.",
      "Well, THAT narrows it down.",
      "It's very important in life to know when to shut up. You should not be afraid of silence.",
      "I think what makes Jeopardy! special is that, among all the quiz and game shows out there, ours tends to encourage learning.",
      "Hahahahaha... No.",
      "They teach you that in school in Utah, huh?"
    ]
  },
  "GENERIC_RESPONSE": {
    "description": "Responses Trebekbot will give when someone invokes trebekbot while there is no active round.",
    "required": true,
    "value": [
      "Welcome back to Slack Jeopardy. Before we begin this Jeopardy round, I'd like to ask our contestants once again to please refrain from using ethnic slurs.",
      "Okay, Turd Ferguson.",
      "I hate my job.",
      "Let's just get this over with.",
      "Do you have an answer?",
      "I don't believe this. Where did you get that magic marker? We frisked you on the way in here.",
      "What a ride it has been, but boy, oh boy, these Slack users did not know the right answers to any of the questions.",
      "Back off. I don't have to take that from you.",
      "That is _awful_.",
      "Okay, for the sake of tradition, let's take a look at the answers.",
      "Beautiful. Just beautiful.",
      "Good for you. Well, as always, three perfectly good charities have been deprived of money, here on Slack Jeopardy. I'm BOT_USERNAME, and all of you should be ashamed of yourselves! Good night!",
      "And welcome back to Slack Jeopardy. Because of what just happened before during the commercial, I'd like to apologize to all blind people and children.",
      "Thank you, thank you. Moving on.",
      "I really thought that was going to work.",
      "For the last time, that is not a category.",
      "Unbelievable.",
      "Uh, I see. Get back to your podium.",
      "You look pretty sure of yourself. Think you've got the right answer?",
      "Welcome back to Slack Jeopardy. We've got a real barnburner on our hands here.",
      "And welcome back to Slack Jeopardy. I'd like to once again remind our contestants that there are proper bathroom facilities located in the studio.",
      "Welcome back to Slack Jeopardy. Once again, I'm going to recommend that our viewers watch something else.",
      "Don't tell me what you believe in. I'll observe how you behave and I will make my own determination.",
      "It's very important in life to know when to shut up. You should not be afraid of silence."
    ]
  },

}
